## <font color="purple"><h4 align="center">READ/WRITE EXCEL Files in PANDAS</font>

### <font color="purple">Read Excel</color>

In [2]:
import pandas as pd
df=pd.read_excel('stock_data.xlsx',"Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [3]:
def name_convert(cell):
    if cell=="n.a.":
        return "Sam Walton"
    return cell

df = pd.read_excel("stock_data.xlsx","Sheet1",converters={
    'people': name_convert
}
    ,na_values={
        'eps': ['not available'],
        'revenue': [-1],
        'price':["n.a."]
    })
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0     Sam Walton
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

### <font color="purple">Write to Excel</color>

In [6]:
df.to_excel("new.xlsx", sheet_name="stocks",startrow=2, startcol=1)

**Write two dataframes to two separate sheets in excel**

In [7]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [8]:
df_stocks

  tickers  price     pe    eps
0   GOOGL    845  30.37  27.82
1     WMT     65  14.26   4.61
2    MSFT     64  30.97   2.12

In [9]:
df_weather

        day  temperature  event
0  1/1/2017           32   Rain
1  1/2/2017           35  Sunny
2  1/3/2017           28   Snow

In [12]:
with pd.ExcelWriter('new1.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks",index=False)
    df_weather.to_excel(writer, sheet_name="weather",index=False)
    df.to_excel(writer, sheet_name="stocks1")

Reference: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html